posts/hello-world.org
#+TITLE: My new blog
#+DATE: <2017-09-17 Sun>

After keeping silence for many years, I am starting a new blog, 
* Hello, twisted spacetime
This is my new blog system, which is still under construction.
In this space, I will talk about Scheme, Linux, and other related topics, these will record my adventure into Schemer's land.

* Build of this site
For integrating these things, these tools are used:
 - emacs
 - org-mode
 - org-static-blog
 - language-tool
 - emacs langtool
 - git
 and more.

