hello-world.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"https://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="https://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<link rel="alternate"
      type="appliation/rss+xml"
      href="http://chaoseternal.netrss.xml"
      title="RSS feed for http://chaoseternal.net">
<title>My new blog</title></head>
<body>
<div id="preamble" class="status"></div>
<div id="content"><div class="post-date">17 Sep 2017</div><h1 class="post-title"><a href="http://chaoseternal.nethello-world.html">My new blog</a></h1>
<p>
After keeping silence for many years, I am starting a new blog, 
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Hello, twisted spacetime</h2>
<div class="outline-text-2" id="text-1">
<p>
This is my new blog system, which is still under construction.
In this space, I will talk about Scheme, Linux, and other related topics, these will record my adventure into Schemer's land.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Build of this site</h2>
<div class="outline-text-2" id="text-2">
<p>
For integrating these things, these tools are used:
</p>
<ul class="org-ul">
<li>emacs
</li>
<li>org-mode
</li>
<li>org-static-blog
</li>
<li>language-tool
</li>
<li>emacs langtool
</li>
<li>git
</li>
</ul>
<p>
and more.
</p>
</div>
</div>
</div>
<div id="postamble" class="status"></div>
</body>
</html>
